[{"id":"someid","title":"sometitle","text":"sometext"},{"id":"Zxc9i8dxgh","title":"Color Note","text":"Testing another new note"},{"id":"3TEcnGEVBW","title":"mozzila ","text":"const queryADatabase = function(mysql, query) {\n  return new Promise((resolve, reject) => {\n    mysql.query(query, (err, rows) => {\n      if (err) reject(err);\n      else resolve(rows);\n    });\n  })\n};\n\n/* What we're doing here is creating a promise that resolves or rejects \nbased on the outcome of an SQL query. Breaking it down, our outermost function\ntakes a database instance and an SQL query. That function will return a promise. \nThat promise will reject if the SQL query throws and resolve (returning the \ndatabase info) if the query goes through successfully. */"},{"id":"GndUspGrm5","title":"A Node to add!","text":"Adding a note once again"},{"id":"rsIbmZgY-R","title":"A Note to delete ","text":"let noteTitle;\nlet noteText;\nlet saveNoteBtn;\nlet newNoteBtn;\nlet noteList;\nif (window.location.pathname === '/notes') {\n  noteTitle = document.querySelector('.note-title');\n  noteText = document.querySelector('.note-textarea');\n  saveNoteBtn = document.querySelector('.save-note');\n  newNoteBtn = document.querySelector('.new-note');\n  noteList = document.querySelectorAll('.list-container .list-group');\n}"},{"id":"KeHlRg94Ce","title":"A Note to Change- my new not","text":"    News - Changin\n    NBC News NOW\n    Nightly News\n    Meet the Press\n    Dateline\n    MSNBC\n    TODAY\n\n    Covid: Special ReportPoliticsU.S. NewsOpinionBusinessWorldDo No Harm\n\nRussian hackers breach U.S. government, targeting agencies, private companies\n\n    Share this —\n\nSections\n\n    CORONAVIRUS\n    U.S. News\n    Politics\n    World\n    Local\n    Business\n    Health\n    Investigations\n    Culture Matters\n    Science\n    Sports\n    Tech & Media\n    Decision 2020\n    Video Features\n    Photos\n    Weather\n    Shopping\n\nTV\n\n    Today\n    MSNBC\n    Nightly News\n    Meet The Press\n    Dateline\n\nFeatured\n\n    NBC NEWS NOW\n    THINK\n    BETTER\n    NIGHTLY FILMS\n    ASIAN AMERICA\n    NBC LATINO\n    NBCBLK\n    NBC OUT\n    STAY TUNED\n    SPECIAL FEATURES\n    NEWSLETTERS\n    PODCASTS\n\nMore from NBC\n\n    CNBC\n    NBC.COM\n    NBC LEARN\n    Peacock\n    Next Steps for Vets\n    Parent Toolkit\n    NBC Archives\n    Know Your Value\n    COUPONS\n\nFollow NBC News\n\n    Print\n    Whatsapp\n    Reddit\n    Pocket\n    Flipboard\n    Pinterest\n    Linkedin\n\nU.S. news\nRussian hackers breach U.S. government, targeting agencies, private companies\nThe CEO of cybersecurity company FireEye said they appeared to be trying to steal information from government clients.\nCybersecurity official says Russia behind hack on Treasury, Commerce departments\nDec. 13, 202002:25\nDec. 13, 2020, 5:07 PM PST\nBy Ken Dilanian, Josh Lederman and Tim Stelloh\n\nHackers who targeted the federal government appear to be part of a Russian intelligence campaign aimed at multiple U.S. agencies and companies, including the cybersecurity company FireEye, officials said Sunday.\n\nA Commerce Department spokesman confirmed a breach, saying it occurred at an unidentified bureau.\n\nDepartment officials alerted the FBI and a cybersecurity agency within the Department of Homeland Security, the spokesman said, declining to comment further.\n\nThe White House National Security Council also confirmed that it was looking into another potential intrusion at the Treasury Department after Reuters reported that foreign government-backed hackers accessed internal government emails.\n\nThe Washington Post first reported that the hacks were carried out by Russia's Foreign Intelligence Service, or SVR.\n\nAmong the SVR's targets was FireEye, a major U.S. cybersecurity company with extensive government contracts, The Post reported. The company's CEO said last week that it had been hacked \"by a nation with top-tier offensive capabilities.\"\n\nA private cybersecurity official briefed on the matter confirmed the SVR's involvement to NBC News.\n\nFireEye CEO Kevin Mandia said the hackers' primary goal appeared to be to steal information from the company's government clients.\nRecommended\nU.S. news\nMan killed after opening fire outside New York City cathedral\nU.S. news\nJohn le Carré, author of 'Tinker Tailor Soldier Spy,' dies at 89\n\nIt wasn't clear how much information the hackers accessed, although the company said they obtained tools used by FireEye's Red Team, the section tasked with defending against new cyberattacks.\n\nThe Post reported that the Commerce Department breach targeted Solar Winds, an information technology system used by tens of thousands of organizations. NBC News hasn't independently confirmed the report.\n\nThe FBI and the National Security Agency declined to comment Sunday.\n\nIn a statement, the Homeland Security Department's cybersecurity agency said it was investigating \"recently discovered activity on government networks.\"\n\nThe agency said it was providing technical assistance to help blunt potential compromises.\nImage: Ken DilanianKen Dilanian\n\nKen Dilanian is a correspondent covering intelligence and national security for the NBC News Investigative Unit.\nImage: Josh LedermanJosh Lederman\n\nJosh Lederman is a national political reporter for NBC News.\nTim Stelloh\n\nTim Stelloh is a reporter for NBC News based in California.\n\n    About\n    Contact\n    Careers\n    Coupons\n    Privacy policy\n    Do Not Sell My Personal Information\n    CA Notice\n    Terms of Service\n    NBCNews.COM Site Map\n    Advertise\n    Ad Choices\n\n© 2020 NBC UNIVERSAL\n\n"}]